# Predict Housing Prices with regularized regression

In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
from sklearn.model_selection import train_test_split
from sklearn.linear_model import LinearRegression
from sklearn.linear_model import Lasso
from sklearn.linear_model import Ridge

In [3]:
data=pd.read_csv('house.csv')
data.head()

   Area  Total Rooms  Bedrooms  Bathroom  Amount(in rupees)
0  2104            3         1         2             399900
1  1600            3         2         2             329900
2  2400            3         2         2             369000
3  1416            2         1         1             232000
4  3000            4         2         2             539900

In [4]:
data.isna().sum()

Area                 0
Total Rooms          0
Bedrooms             0
Bathroom             0
Amount(in rupees)    0
dtype: int64

In [8]:
x=data.iloc[:,:4]
x.head()

   Area  Total Rooms  Bedrooms  Bathroom
0  2104            3         1         2
1  1600            3         2         2
2  2400            3         2         2
3  1416            2         1         1
4  3000            4         2         2

In [9]:
y=data.iloc[:,-1:]
y.head()

   Amount(in rupees)
0             399900
1             329900
2             369000
3             232000
4             539900

In [10]:
xtrain,xtest,ytrain,ytest=train_test_split(x,y,test_size=0.25,random_state=42)
print(len(xtest),len(ytest))

12 12

In [11]:
xtrain.shape

(35, 4)

In [12]:
ytrain.shape

(35, 1)

In [13]:
base_reg=LinearRegression()
base_reg.fit(xtrain,ytrain)
base_pred=base_reg.predict(xtest)

In [14]:
from sklearn.metrics import r2_score
print('R-Square:\t',r2_score(ytest,base_pred))
print()
print('Base Train Score:\t',base_reg.score(xtrain,ytrain))
print()
print('Base Train Score:\t',base_reg.score(xtest,ytest))

R-Square:	 0.6487644480662038

Base Train Score:	 0.7667224811749975

Base Train Score:	 0.6487644480662038

In [15]:
print("Lasso Regression Model")
print()
lr=Lasso(alpha=0.01)
lr.fit(xtrain,ytrain)
lr_pred=lr.predict(xtest)
print("Lasso Train_score:\t", lr.score(xtrain,ytrain))
print()
print("Lasso Test_score:\t", lr.score(xtest,ytest))
print()
print("Lasso R-Square:\t",r2_score(ytest,lr_pred))

Lasso Regression Model

Lasso Train_score:	 0.7667224811741168

Lasso Test_score:	 0.648764567455816

Lasso R-Square:	 0.648764567455816

In [17]:
from sklearn.metrics import mean_squared_error
from sklearn.metrics import mean_absolute_error
print('Mean Squared Error: \t', mean_squared_error(ytest,lr_pred))
print()
print('RMSE: \t', np. sqrt (mean_squared_error(ytest,lr_pred)))
print()
print('Mean Absolute Error: \t', mean_absolute_error(ytest,lr_pred))

Mean Squared Error: 	 6820596282.581581

RMSE: 	 82586.90139835482

Mean Absolute Error: 	 61774.50143859239

In [19]:
print("Ridge Regression Model")
print()
rr=Lasso(alpha=0.01)
rr.fit(xtrain,ytrain)
rr_pred=rr.predict(xtest)
print("Ridge Train_score:\t", rr.score(xtrain,ytrain))
print()
print("Ridge Test_score:\t", rr.score(xtest,ytest))
print()
print("Ridge R-Square:\t",r2_score(ytest,rr_pred))

Ridge Regression Model

Ridge Train_score:	 0.7667224811741168

Ridge Test_score:	 0.648764567455816

Ridge R-Square:	 0.648764567455816

In [20]:
from sklearn.metrics import mean_squared_error
from sklearn.metrics import mean_absolute_error
print('Mean Squared Error: \t', mean_squared_error(ytest,rr_pred))
print()
print('RMSE: \t', np. sqrt (mean_squared_error(ytest,rr_pred)))
print()
print('Mean Absolute Error: \t', mean_absolute_error(ytest,rr_pred))

Mean Squared Error: 	 6820596282.581581

RMSE: 	 82586.90139835482

Mean Absolute Error: 	 61774.50143859239

In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [ ]:
from sklearn.model_selection import train_test_split
from sklearn.linear_model import LinearRegression
from sklearn.metrics import mean_square_error
from sklearn.metrics import mean_absolute_error
from sklearn.metrics import r2_score

In [2]:
df=pd.read_csv('Employee Data.csv')
df.head()

   Employment_ID Education  Experience  Training_hours  No. of Projects
0           8949  Graduate          20              36                4
1          29725  Graduate          15              47                3
2          11561  Graduate           5              83                4
3          33241  Graduate           1              52                2
4            666   Masters          20               8                3